
     A          R CSCFSR
     A            RGSRVNM       64A
     A            RGLIBNM       10A
     A            RGPRCHD       10A
     A            RGPRCNM      255A
     A            RGAPPID      128A
     A          K RGSRVNM
