
     A          R CSAPBREGR
     A            RGSRVNM       64A
     A            RGLIBNM       10A
     A            RGPRCHD       10A
     A            RGPRCNM      255A
     A          K RGSRVNM

